pblfrnndmnr/control-bomba-isl1208-pic16-xc8/Control_BOMBA_RTC_ISL1208_V6.X/main.c
                        }
                    } else {
                        //TODO ya finalizo la secuencia de arranque, entonces veo si se estabilizó la corriente
                        if (mediciondecorriente <= CORRIENTENORMALMAXIMA) {
                            estadofallacorriente = CORRIENTENORMAL;
                            cuenta_tiempofalla = 0;
                        } else {
                            //aca verifica si la falla está presente mucho tiempo con tiempofalla
                            if (indica_tiempo_falla == 0) {
                                if (cuenta_tiempofalla == 0) {
                                    cuenta_tiempofalla = tiempofalla;
                                }
                            } else {
                                //Expiro el tiempo de falla con una falla de sobrecorriente, debo apagar la bomba
                                estadofallacorriente = FALLACORRIENTE;
                                indica_tiempo_falla = 0;
                                cuenta_tiempofalla = 0;
                                indica_secuencia_arranque = 0;
                                tiempo_secuencia_arranque = 0;
                                bandera_orden_on_off_bomba = 0; //cambia la bandera de orden de encendido de bomba
                            }


                        }
                        if (mediciondecorriente >= CORRIENTENORMALMINIMA) {
                            estadonivel = NIVELNORMAL;

                        } else {
                            indica_secuencia_arranque = 0;
                            tiempo_secuencia_arranque = 0;
                            bandera_orden_on_off_bomba = 0;
                            estadonivel = NIVELBAJO;
                        }
                    }
                } else {
                    //TODO En caso de haber falla tambien debo resetear estos valores?
                    indica_secuencia_arranque = 0;
                    tiempo_secuencia_arranque = 0;
                    activabomba = APAGABOMBA;
                }
            } else {

            }


        }



        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Actualiza Display">
        //Actualiza Display
        /////////////////////////////////////////////
        if (refrescadisplay) {
            vGotoxyLCD(1, 1);
            cadena = cadenaamostrar;
            while (*cadena != '\0')
                vLCD_Putc(*cadena++);
            vGotoxyLCD(1, 2);
            cadena = cadenaamostrar2;
            while (*cadena != '\0')
                vLCD_Putc(*cadena++);

            refrescadisplay = 0;
        }
        ////////////////////////////////////////////////
        //Fin Actualiza Display
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Graba datos">
        // <editor-fold defaultstate="collapsed" desc="Graba Nuevos datos en el RTC">
        //Graba Nuevos datos en el RC
        /////////////////////////////////////////////////
        if (bandera_graba_global) {
            if (bandera_graba_hora) {
                if (horario == &horarioactual) {
                    isl1208_set_time((*horario).hrs, (*horario).min, 00);
                    buzzer_on();
                }
                if (horario == &horarioenc) {
                    isl1208_set_time_enc((*horario).hrs, (*horario).min, 00);
                    //TODO isl1208_set_dow_enc(&fechaenc.dow);
                    buzzer_on();
                }
            }
            if (bandera_graba_fecha) {
                isl1208_set_date(&fecha.day, &fecha.month, &fecha.yr, &fecha.dow);
                buzzer_on();
            }
        }
        bandera_graba_hora = 0;
        bandera_graba_fecha = 0;
        //////////////////////////////////////////////////////////////////
        //Finaliza Graba Nuevos datos en el RTC
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Graba Nuevos datos en la EEPROM DEL PIC">
        //DIRECCION 0: periodoencendido(cada cuanto se enciende la bomba en automatico), de 0 a 6 dias,
        //DIRECCION 1: tiempoencendido (cuanto tiempo permanece encendida la bomba en automatico) 0 a 60 minutos
        //DIRECCION 2: usa_falla_de_corriente (dice si se usa falla de corriente o no)
        //DIRECCION 3: usa_nivel_bajo (indica si se usa la deteccion de nivel bajo)
        //DIRECCION 4: tiempofalla (cuanto tiempo puede estar en falla de corriente antes de apagar la bomba por seguridad) 0 a 10 segundos


        if (bandera_graba_global) {
            di();
            if (bandera_graba_periodoencendido) {
                eeprom_write(0, periodoencendido);
                buzzer_on();
            }
            if (bandera_graba_tiempoencendido) {
                eeprom_write(1, tiempoencendido);
                buzzer_on();
            }
            if (bandera_graba_usa_falla_de_corriente) {
                eeprom_write(2, usa_falla_de_corriente);
                buzzer_on();
            }
            if (bandera_graba_usa_nivel_bajo) {
                eeprom_write(3, usa_nivel_bajo);
                buzzer_on();
            }
            if (bandera_graba_tiempofalla) {
                eeprom_write(4, tiempofalla);
                buzzer_on();
            }
            ei();
        }
        bandera_graba_global = 0;
        bandera_graba_periodoencendido = 0;
        bandera_graba_tiempoencendido = 0;
        bandera_graba_usa_falla_de_corriente = 0;
        bandera_graba_usa_nivel_bajo = 0;
        bandera_graba_tiempofalla = 0;
        // </editor-fold>
        // </editor-fold>
        NOP();
        NOP();
    }
}

